uhnp/src/Catalogs/ВерсииРегламентовПодготовкиОтчетности/ВерсииРегламентовПодготовкиОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииРегламентовПодготовкиОтчетности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодставлятьЗначенияАналитикПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиПересчитыватьЗависимыеПоказатели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСверкиВГО</name>
    <type>
      <types>CatalogRef.ШаблоныСверкиВГО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроцесс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещатьДокументыВнеПроцесса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРасширенныеНастройкиПериметра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетЭффективныхДолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТолькоУтвержденныеДанныеПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураГруппы</name>
    <attributes>
      <name>ОрганизационнаяЕдиница</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизационнаяЕдиницаРодитель</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОрганизационныеЕдиницы</name>
    <attributes>
      <name>ОрганизационнаяЕдиницаРодитель</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизационнаяЕдиница</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяВалюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОрганизационнойЕдиницы</name>
      <type>
        <types>CatalogRef.ВидыОрганизационныхЕдиниц</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективнаяДоля</name>
      <comment>используется если ручное заполнение долей(Не РасчетЭффективныхДолей)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>15</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтношениеКГруппе</name>
      <type>
        <types>CatalogRef.ГруппыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодИсключенияВГО</name>
      <type>
        <types>EnumRef.МетодыИсключенияВГО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВалюты</name>
    <attributes>
      <name>ОрганизационнаяЕдиница</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/СтатусыПериодовСценариев/СтатусыПериодовСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПериодовСценариев</name>
  <resources>
    <name>СтатусПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусБлокировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияРегламента</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </resources>
  <attributes>
    <name>УправлениеПериодомСценария</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарии</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периоды</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организации</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыОтношенийКГруппе/ВидыОтношенийКГруппе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтношенийКГруппе</name>
  <enumValues>
    <name>Материнское</name>
    <comment>Консолидируется и является основной единицей холдинга, на которую заведены все инвестиции</comment>
  </enumValues>
  <enumValues>
    <name>Дочернее</name>
    <comment>Консолидируется в отчетности Группы</comment>
  </enumValues>
  <enumValues>
    <name>Ассоциированное</name>
    <comment>Не консолидируются в отчетности Группы, отражаются по методу долевого участия(инвестиция равна доли в чистых активах)</comment>
  </enumValues>
  <enumValues>
    <name>Совместное</name>
    <comment>Не консолидируются в отчетности Группы, отражаются по методу долевого участия(инвестиция равна доли в чистых активах)</comment>
  </enumValues>
  <enumValues>
    <name>СвязанныеСтороны</name>
    <comment>Не консолидируются, используется для сбора данных в части раскрытия операций со связанными сторонами</comment>
  </enumValues>
  <enumValues>
    <name>ТретьиСтороны</name>
    <comment>Не консолидируются в периметре</comment>
  </enumValues>
  <enumValues>
    <name>СовместныеОперации</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ВерсииРегламентовПодготовкиОтчетности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область КИК

Функция ПолучитьАктуальныйРегламент(Сценарий, МеткаВремени) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка,
	|	т.МеткаВремени
	|ИЗ
	|	Справочник.ВерсииРегламентовПодготовкиОтчетности КАК т
	|ГДЕ
	|	т.МеткаВремени <= &МеткаВремени
	|	И т.Сценарий = &Сценарий
	|	И НЕ т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.МеткаВремени УБЫВ");
	
	Запрос.УстановитьПараметр("МеткаВремени", МеткаВремени);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда		
		Возврат ПустаяСсылка();
	Иначе 
		Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСоздатьРегламентКИК(Сценарий, МеткаВремени, ТаблицаИнвесторОбъектИнвестирования, ГруппаВидОтчета = Неопределено, Регламент = Неопределено) Экспорт
	
	РегламентСсылка = Регламент;
	Если Не ЗначениеЗаполнено(РегламентСсылка) Тогда		
		РегламентСсылка = ПолучитьРегламент(Сценарий, МеткаВремени);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РегламентСсылка) Тогда
		
		Возврат СоздатьРегламент(
				Сценарий, 
				МеткаВремени, 
				ПолучитьДеревоКИК(ТаблицаИнвесторОбъектИнвестирования, МеткаВремени, Сценарий), 
				ГруппаВидОтчета
			);
		
	Иначе 
		
		ОбъектРегламент = РегламентСсылка.ПолучитьОбъект();
		
		ОбъектРегламент.МеткаВремени = МеткаВремени;
		ОбъектРегламент.Сценарий = Сценарий;
		ОбъектРегламент.РасчетЭффективныхДолей = Истина;
		ОбъектРегламент.ИспользоватьРасширенныеНастройкиПериметра = Истина;
		ОбъектРегламент.Наименование = НСтр("ru = 'Расчет КИК'");
		
		Если ГруппаВидОтчета <> Неопределено Тогда
			ОбъектРегламент.ВидОтчета = ГруппаВидОтчета;
		КонецЕсли;
		
		РегламентыВызовСервера.ЗаполнитьОбъектПоДереву(ОбъектРегламент, ПолучитьДеревоКИК(ТаблицаИнвесторОбъектИнвестирования, МеткаВремени, Сценарий));
		
		Попытка
			ОбъектРегламент.Записать();
		Исключение
			
			СтрокаШаблона = НСтр("ru = 'Не удалось обновить регламент КИК <%1>:'") + " ";
			
			Если ЗначениеЗаполнено(СтрокаШаблона) тогда
				ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(СтрокаШаблона + ОписаниеОшибки(), РегламентСсылка));
			КонецЕсли;
			
			Возврат Справочники.ВерсииРегламентовПодготовкиОтчетности.ПустаяСсылка();
		КонецПопытки;
		
		Возврат ОбъектРегламент.Ссылка;
		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

// Заполняет метод исключения ВГО
//
Процедура ЗаполнитьМетодИсключенияВГО() Экспорт
	
	ЗапросРегламенты = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регламент.Ссылка КАК Регламент,
	|	Регламент.ОрганизационнаяЕдиницаРодитель КАК Консолидирующая
	|ИЗ
	|	Справочник.ВерсииРегламентовПодготовкиОтчетности.ОрганизационныеЕдиницы КАК Регламент
	|ГДЕ
	|	Регламент.МетодИсключенияВГО = ЗНАЧЕНИЕ(Перечисление.МетодыИсключенияВГО.ПустаяСсылка)
	|ИТОГИ ПО
	|	Регламент");
	
	ОтношенияМатеринские = Справочники.ГруппыКонтрагентов.ПолучитьОтношенияКГруппе(ПредопределенноеЗначение("Перечисление.ВидыОтношенийКГруппе.Материнское"));
	
	Если ОтношенияМатеринские.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПоРегламенту = ЗапросРегламенты.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаПоРегламенту.Следующий() Цикл
		
		Объект = ВыборкаПоРегламенту.Регламент.ПолучитьОбъект();
		
		КэшируемыеЗначения = Новый Структура;
		КэшируемыеЗначения.Вставить("Регламент",	Объект.Ссылка);
		КэшируемыеЗначения.Вставить("Период", 		Объект.МеткаВремени);
		КэшируемыеЗначения.Вставить("Сценарий", 	Объект.Сценарий);
		
		ВыборкаПоКонсолидирующей = ВыборкаПоРегламенту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаПоКонсолидирующей.Следующий() Цикл
			
			Материнские = Новый Массив;
			
			Для каждого ТекущееОтношение Из ОтношенияМатеринские Цикл
				Отбор = Новый Структура("ОрганизационнаяЕдиницаРодитель,ОтношениеКГруппе", ВыборкаПоКонсолидирующей.Консолидирующая, ТекущееОтношение);
				Для каждого СтрокаМатеринская Из Объект.ОрганизационныеЕдиницы.НайтиСтроки(Отбор) Цикл
					Материнские.Добавить(СтрокаМатеринская.ОрганизационнаяЕдиница);
				КонецЦикла;
			КонецЦикла;
			
			РеквизитыЗаполнитьОбъектыИнвестирования = Новый Структура;
			РеквизитыЗаполнитьОбъектыИнвестирования.Вставить("Инвестор", Материнские);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьОбъектыИнвестирования", РеквизитыЗаполнитьОбъектыИнвестирования);
			
			Кэш = РегламентыВызовСервера.ПолучитьКешируемыеЗначения(СтруктураДействий, КэшируемыеЗначения);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьМетодИсключенияВГО");
			
			КэшируемыеЗначения.Вставить("ОбъектыИнвестирования", Кэш.ОбъектыИнвестирования);
			
			Отбор.Удалить("ОтношениеКГруппе");
			РегламентыКлиентСервер.ОбработатьСтрокиТЧ(Объект.ОрганизационныеЕдиницы.НайтиСтроки(Отбор), СтруктураДействий, КэшируемыеЗначения);
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазыБМ.ЗаписатьОбъект(Объект);
		
	КонецЦикла;
	
КонецПроцедуры

// Устарела
Функция АвтоматическиПересчитыватьЗависимыеПоказатели(ПериодОтчета, Сценарий) Экспорт
	
	Возврат ПолучитьНастройкуРегламента(ПериодОтчета, Сценарий, "АвтоматическиПересчитыватьЗависимыеПоказатели", Ложь);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРегламент(Сценарий, МеткаВремени)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка
	|ИЗ
	|	Справочник.ВерсииРегламентовПодготовкиОтчетности КАК т
	|ГДЕ
	|	т.МеткаВремени = &МеткаВремени
	|	И т.Сценарий = &Сценарий
	|	И НЕ т.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("МеткаВремени", МеткаВремени);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда		
		Возврат ПустаяСсылка();
	Иначе 
		Возврат РезультатЗапроса.Выгрузить()[0].Ссылка
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДеревоКИК(ТаблицаИнвесторОбъектИнвестирования, МеткаВремени, Сценарий)
	
	Дерево = ПолучитьДеревоСтруктураГруппы();
	
	КэшируемыеЗначения = Новый Структура;
	КэшируемыеЗначения.Вставить("Период", 	МеткаВремени);
	КэшируемыеЗначения.Вставить("Сценарий", Сценарий);
	КэшируемыеЗначения.Вставить("Регламент", Неопределено);
	КэшируемыеЗначения.Вставить("ОтношенияМатеринское", Справочники.ГруппыКонтрагентов.ПолучитьОтношенияКГруппе(Перечисления.ВидыОтношенийКГруппе.Материнское) );
	КэшируемыеЗначения.Вставить("СтруктураГруппы", Дерево);
			
	Для каждого СтрокаТаб Из ТаблицаИнвесторОбъектИнвестирования Цикл
		
		УзелИнвестор = Дерево.Строки.Найти(СтрокаТаб.Инвестор, "ОрганизационнаяЕдиница", Ложь);
		Если УзелИнвестор = Неопределено Тогда
			
			КэшируемыеЗначения.Вставить("ТекущийРодитель", 	Дерево);
			
			УзелИнвестор = Дерево.Строки.Добавить();
			УзелИнвестор.ОрганизационнаяЕдиница = СтрокаТаб.Инвестор;
			
			СтруктураДействий = Новый Структура("ЗаполнитьОбъектыИнвестирования,
			|ЗаполнитьДочерние,
			|ЗаполнитьВалюты,
			|ЗаполнитьЭффективнуюДолю,
			|ЗаполнитьОтношениеКГруппе");
			
			СтруктураДействий.Вставить("ЗаполнитьОбъектыИнвестирования", Новый Структура("Инвестор", СтрокаТаб.Инвестор));
			РегламентыКлиентСервер.ОбработатьСтрокуТЧ(УзелИнвестор, СтруктураДействий, КэшируемыеЗначения);
			
			//КэшируемыеЗначения.Вставить("ТекущийРодитель", Дерево);
			//
			//ЗаполнитьВалюты = Новый Структура("Инвестор,ОбновитьДочерние", СтрокаТаб.Инвестор, Истина);
			//СтруктураДействий = Новый Структура("ЗаполнитьВалюты", ЗаполнитьВалюты);
			//РегламентыКлиентСервер.ОбработатьСтрокуТЧ(УзелИнвестор, СтруктураДействий, КэшируемыеЗначения);
			//
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Дерево; 
	
КонецФункции

Функция СоздатьРегламент(Сценарий, МеткаВремени, Дерево, ГруппаВидОтчета = Неопределено)
	
	Регламент = СоздатьЭлемент();
	
	Регламент.МеткаВремени = МеткаВремени;
	Регламент.Сценарий = Сценарий;
	Регламент.ИспользоватьРасширенныеНастройкиПериметра = Истина;
	Регламент.РасчетЭффективныхДолей = Истина;
	Регламент.Наименование = Нстр("ru = 'Расчет КИК'");
	
	Если ГруппаВидОтчета <> Неопределено Тогда
		Регламент.ВидОтчета = ГруппаВидОтчета;
	КонецЕсли;
	
	РегламентыВызовСервера.ЗаполнитьОбъектПоДереву(Регламент, Дерево);
	
	Попытка
		Регламент.Записать();
	Исключение
		
		СтрокаШаблона = НСтр("ru = 'Не удалось создать регламент <%1>:'") + " ";
		
		Если ЗначениеЗаполнено(СтрокаШаблона) тогда
			ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(СтрокаШаблона + ОписаниеОшибки(), Регламент.Наименование));
		КонецЕсли;
		
		Возврат Справочники.ВерсииРегламентовПодготовкиОтчетности.ПустаяСсылка();
	КонецПопытки;
	
	Возврат Регламент.Ссылка;
	
КонецФункции

Функция ПолучитьДеревоСтруктураГруппы()
	
	Дерево = Новый ДеревоЗначений;
	
	КолонкиИсточники = Новый Структура("
	|ТипОрганизационнойЕдиницы,
	|ОсновнаяВалюта,
	//|ДополнительныеВалюты,
	|ОрганизационнаяЕдиница,
	|ПометкаУдаления,
	|ВидОрганизационнойЕдиницы,
	|ОтношениеКГруппе,
	|ТолькоПросмотр,
	|КонсолидирующаяОрганизацияОтображение,
	|ЭффективнаяДоля,
	|ЯвляетсяКонсолидирующей,
	|ДоступностьДолиВладения,
	|ЭлиминирующаяОрганизация,
	|ОграничениеДоступа,
	|ЯвляетсяЦФО,
	|МетодИсключенияВГО,
	|СтатусИностраннойКомпании,
	|ИностранныйНалоговыйРезидент,
	|ИспользоватьВРегламентированномУчете");
	
	Для каждого КолонкаИсточник Из КолонкиИсточники Цикл
		Дерево.Колонки.Добавить(КолонкаИсточник.Ключ);
	КонецЦикла;
	
	Дерево.Колонки.Добавить("ДополнительныеВалюты", Новый ОписаниеТипов("СписокЗначений"));
	
	Возврат Дерево;
	
КонецФункции

// Устарела
Функция ПолучитьНастройкуРегламента(ПериодОтчета, Сценарий, ИмяНастройки, ЗначениеПоУмолчанию=Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтатусыПериодовСценариев.ВерсияРегламента." + ИмяНастройки + " КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.СтатусыПериодовСценариев КАК СтатусыПериодовСценариев
	|ГДЕ
	|	СтатусыПериодовСценариев.Сценарии = &Сценарии
	|	И СтатусыПериодовСценариев.Периоды = &Периоды";
	
	Запрос.УстановитьПараметр("Периоды", ПериодОтчета);
	Запрос.УстановитьПараметр("Сценарии", Сценарий);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;    
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ЗначениеНастройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
